spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_with_the_webhook_from_stripe_for_charge_succeeeded.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_14cL8LLYcdnh37DjnTtrg06n
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_9oE8bTWTjqMGMaYlLrhEZe13
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin12.0","publisher":"stripe","uname":"Darwin
        joshuas-mbp.home 13.3.0 Darwin Kernel Version 13.3.0: Tue Jun  3 21:27:35
        PDT 2014; root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 13 Sep 2014 18:51:34 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1690'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-08-20'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_14cL8LLYcdnh37DjnTtrg06n",
          "created": 1410632429,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_14cL8LLYcdnh37DjeGUwZL0v",
              "object": "charge",
              "created": 1410632429,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "card": {
                "id": "card_14cL8KLYcdnh37DjNztsyDHQ",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 9,
                "exp_year": 2016,
                "fingerprint": "bWHi70YuX8gdz3kp",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4lsu4Uj5ekkxhx"
              },
              "captured": true,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_14cL8LLYcdnh37DjeGUwZL0v/refunds",
                "data": []
              },
              "balance_transaction": "txn_14cL8LLYcdnh37DjBCcNPctK",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_4lsu4Uj5ekkxhx",
              "invoice": "in_14cL8LLYcdnh37DjEZwUWGoW",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": "Myflix",
              "receipt_email": null
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_4lsuPFunuSqxrg"
        }
    http_version: 
  recorded_at: Sat, 13 Sep 2014 18:51:34 GMT
recorded_with: VCR 2.9.2
